benchmarking/benchmark-integration-wrk/test-output/wrk-jwt-output.txt
===================================================================
High-Performance JWT Benchmark with In-Memory Tokens
===================================================================
Keycloak URL: https://localhost:1443
Service URL: https://localhost:10443
Token Count: 100
WRK Configuration: 4 threads, 20 connections, 30s duration

Fetching 100 tokens from Keycloak (in-memory)...
Successfully loaded 100 tokens in memory

Starting WRK benchmark with in-memory tokens...
-------------------------------------------------------------------
Loaded 100 tokens from environment
Loaded 100 tokens from environment
Loaded 100 tokens from environment
[...]
Running 30s test @ https://localhost:10443/jwt/validate
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.24ms    7.80ms 105.14ms   87.71%
    Req/Sec     1.76k   354.10     2.61k    75.08%
  Latency Distribution
     50%    2.11ms
     75%    4.08ms
     90%   16.09ms
     99%   32.69ms
  209981 requests in 30.05s, 54.27MB read
Requests/sec:   6986.89
Transfer/sec:      1.81MB
-------------------------------------------------------------------
Benchmark complete!